![##](##.png) 이미지 넣는 법

https://data.seoul.go.kr/ 서울시 청소년 정신건강 통계

/ 그래프로 통계 내보기 /

In [4]:
import pandas as pd

In [5]:
dates = pd.date_range('20190301', periods=6)

In [6]:
dates

DatetimeIndex(['2019-03-01', '2019-03-02', '2019-03-03', '2019-03-04',
               '2019-03-05', '2019-03-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
import numpy as np

In [10]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])

In [11]:
df

                   A         B         C         D
2019-03-01 -1.794333  0.976311  1.332525  0.518983
2019-03-02 -0.225206  0.365416 -1.259369  1.815042
2019-03-03 -0.278202  0.686671 -0.258292  0.652237
2019-03-04 -0.108767 -0.788513 -1.179249 -0.016357
2019-03-05 -0.984029 -1.582406 -2.385097  2.184898
2019-03-06  1.214131  0.092053 -0.109218 -1.085298

In [13]:
type(df)

pandas.core.frame.DataFrame

In [15]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
df.index

DatetimeIndex(['2019-03-01', '2019-03-02', '2019-03-03', '2019-03-04',
               '2019-03-05', '2019-03-06'],
              dtype='datetime64[ns]', freq='D')

In [17]:
df.values

array([[-1.79433327,  0.97631068,  1.33252533,  0.51898261],
       [-0.22520574,  0.36541562, -1.25936876,  1.81504242],
       [-0.27820182,  0.68667058, -0.25829236,  0.65223741],
       [-0.10876722, -0.78851282, -1.17924943, -0.01635684],
       [-0.98402947, -1.58240596, -2.38509732,  2.18489798],
       [ 1.21413061,  0.09205329, -0.109218  , -1.08529764]])

In [20]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.362734 -0.041745 -0.643117  0.678251
std    1.001254  0.967678  1.267912  1.198408
min   -1.794333 -1.582406 -2.385097 -1.085298
25%   -0.807573 -0.568371 -1.239339  0.117478
50%   -0.251704  0.228734 -0.718771  0.585610
75%   -0.137877  0.606357 -0.146487  1.524341
max    1.214131  0.976311  1.332525  2.184898

In [21]:
df.sort_values(by='A')

                   A         B         C         D
2019-03-01 -1.794333  0.976311  1.332525  0.518983
2019-03-05 -0.984029 -1.582406 -2.385097  2.184898
2019-03-03 -0.278202  0.686671 -0.258292  0.652237
2019-03-02 -0.225206  0.365416 -1.259369  1.815042
2019-03-04 -0.108767 -0.788513 -1.179249 -0.016357
2019-03-06  1.214131  0.092053 -0.109218 -1.085298

In [24]:
df.sort_values(by='A', ascending=False)

                   A         B         C         D
2019-03-06  1.214131  0.092053 -0.109218 -1.085298
2019-03-04 -0.108767 -0.788513 -1.179249 -0.016357
2019-03-02 -0.225206  0.365416 -1.259369  1.815042
2019-03-03 -0.278202  0.686671 -0.258292  0.652237
2019-03-05 -0.984029 -1.582406 -2.385097  2.184898
2019-03-01 -1.794333  0.976311  1.332525  0.518983

In [25]:
df['A']

2019-03-01   -1.794333
2019-03-02   -0.225206
2019-03-03   -0.278202
2019-03-04   -0.108767
2019-03-05   -0.984029
2019-03-06    1.214131
Freq: D, Name: A, dtype: float64

In [26]:
type(df['A'])

pandas.core.series.Series

In [27]:
df[0:3]

                   A         B         C         D
2019-03-01 -1.794333  0.976311  1.332525  0.518983
2019-03-02 -0.225206  0.365416 -1.259369  1.815042
2019-03-03 -0.278202  0.686671 -0.258292  0.652237

In [28]:
df.loc['2019-03-01']

A   -1.794333
B    0.976311
C    1.332525
D    0.518983
Name: 2019-03-01 00:00:00, dtype: float64

In [29]:
df.loc['2019-03-01', 'A']

-1.7943332684052038

In [30]:
df.loc['2019-03-01',['A','B']]

A   -1.794333
B    0.976311
Name: 2019-03-01 00:00:00, dtype: float64

In [31]:
df.loc['2019-03-01':'2019-03-02',['A','B']]

                   A         B
2019-03-01 -1.794333  0.976311
2019-03-02 -0.225206  0.365416

In [32]:
df.loc[:,['A','B']]

                   A         B
2019-03-01 -1.794333  0.976311
2019-03-02 -0.225206  0.365416
2019-03-03 -0.278202  0.686671
2019-03-04 -0.108767 -0.788513
2019-03-05 -0.984029 -1.582406
2019-03-06  1.214131  0.092053

In [33]:
df.iloc[0:2]

                   A         B         C         D
2019-03-01 -1.794333  0.976311  1.332525  0.518983
2019-03-02 -0.225206  0.365416 -1.259369  1.815042

In [34]:
df.iloc[0:2, 0:2]

                   A         B
2019-03-01 -1.794333  0.976311
2019-03-02 -0.225206  0.365416

In [39]:
df.iloc[[0,1,2],0:2]

                   A         B
2019-03-01 -1.794333  0.976311
2019-03-02 -0.225206  0.365416
2019-03-03 -0.278202  0.686671

In [41]:
df.iloc[:-1]

                   A         B         C         D
2019-03-01 -1.794333  0.976311  1.332525  0.518983
2019-03-02 -0.225206  0.365416 -1.259369  1.815042
2019-03-03 -0.278202  0.686671 -0.258292  0.652237
2019-03-04 -0.108767 -0.788513 -1.179249 -0.016357
2019-03-05 -0.984029 -1.582406 -2.385097  2.184898

In [47]:
df.iloc[0:5,:]

                   A         B         C         D
2019-03-01 -1.794333  0.976311  1.332525  0.518983
2019-03-02 -0.225206  0.365416 -1.259369  1.815042
2019-03-03 -0.278202  0.686671 -0.258292  0.652237
2019-03-04 -0.108767 -0.788513 -1.179249 -0.016357
2019-03-05 -0.984029 -1.582406 -2.385097  2.184898

In [45]:
df['A']>0

2019-03-01    False
2019-03-02    False
2019-03-03    False
2019-03-04    False
2019-03-05    False
2019-03-06     True
Freq: D, Name: A, dtype: bool

In [54]:
df[df['A']>0] #근데 왜 ABCd가 다 나오는가?

                   A         B         C         D
2019-03-06  1.214131  0.092053 -0.109218 -1.085298

In [55]:
df.iloc[0:2,0:6]

                   A         B         C         D
2019-03-01 -1.794333  0.976311  1.332525  0.518983
2019-03-02 -0.225206  0.365416 -1.259369  1.815042

In [56]:
df

                   A         B         C         D
2019-03-01 -1.794333  0.976311  1.332525  0.518983
2019-03-02 -0.225206  0.365416 -1.259369  1.815042
2019-03-03 -0.278202  0.686671 -0.258292  0.652237
2019-03-04 -0.108767 -0.788513 -1.179249 -0.016357
2019-03-05 -0.984029 -1.582406 -2.385097  2.184898
2019-03-06  1.214131  0.092053 -0.109218 -1.085298

In [57]:
df>0

                A      B      C      D
2019-03-01  False   True   True   True
2019-03-02  False   True  False   True
2019-03-03  False   True  False   True
2019-03-04  False  False  False  False
2019-03-05  False  False  False   True
2019-03-06   True   True  False  False

In [58]:
df[df>0]

                   A         B         C         D
2019-03-01       NaN  0.976311  1.332525  0.518983
2019-03-02       NaN  0.365416       NaN  1.815042
2019-03-03       NaN  0.686671       NaN  0.652237
2019-03-04       NaN       NaN       NaN       NaN
2019-03-05       NaN       NaN       NaN  2.184898
2019-03-06  1.214131  0.092053       NaN       NaN

In [64]:
df2=pd.DataFrame(df, columns=['A','C','D','B'])
df2

                   A         C         D         B
2019-03-01 -1.794333  1.332525  0.518983  0.976311
2019-03-02 -0.225206 -1.259369  1.815042  0.365416
2019-03-03 -0.278202 -0.258292  0.652237  0.686671
2019-03-04 -0.108767 -1.179249 -0.016357 -0.788513
2019-03-05 -0.984029 -2.385097  2.184898 -1.582406
2019-03-06  1.214131 -0.109218 -1.085298  0.092053

In [65]:
df['E']=np.nan
df

                   A         B         C         D   E
2019-03-01 -1.794333  0.976311  1.332525  0.518983 NaN
2019-03-02 -0.225206  0.365416 -1.259369  1.815042 NaN
2019-03-03 -0.278202  0.686671 -0.258292  0.652237 NaN
2019-03-04 -0.108767 -0.788513 -1.179249 -0.016357 NaN
2019-03-05 -0.984029 -1.582406 -2.385097  2.184898 NaN
2019-03-06  1.214131  0.092053 -0.109218 -1.085298 NaN

In [66]:
df.loc['2019-03-02', 'E']=2
df

                   A         B         C         D    E
2019-03-01 -1.794333  0.976311  1.332525  0.518983  NaN
2019-03-02 -0.225206  0.365416 -1.259369  1.815042  2.0
2019-03-03 -0.278202  0.686671 -0.258292  0.652237  NaN
2019-03-04 -0.108767 -0.788513 -1.179249 -0.016357  NaN
2019-03-05 -0.984029 -1.582406 -2.385097  2.184898  NaN
2019-03-06  1.214131  0.092053 -0.109218 -1.085298  NaN

In [67]:
df['F']=df['A']+df['B']
df

                   A         B         C         D    E         F
2019-03-01 -1.794333  0.976311  1.332525  0.518983  NaN -0.818023
2019-03-02 -0.225206  0.365416 -1.259369  1.815042  2.0  0.140210
2019-03-03 -0.278202  0.686671 -0.258292  0.652237  NaN  0.408469
2019-03-04 -0.108767 -0.788513 -1.179249 -0.016357  NaN -0.897280
2019-03-05 -0.984029 -1.582406 -2.385097  2.184898  NaN -2.566435
2019-03-06  1.214131  0.092053 -0.109218 -1.085298  NaN  1.306184

In [71]:
!pip install xlrd

Requirement already satisfied: xlrd in c:\programdata\anaconda3\lib\site-packages (2.0.1)

In [77]:
pd.read_excel("./data/teen.xls")

,기간,구분,스트레스 인지율,스트레스 인지율.1,스트레스 인지율.2,우울감 경험률,우울감 경험률.1,우울감 경험률.2,자살 생각률,자살 생각률.1,자살 생각률.2
0,기간,구분,전체,남학생,여학생,전체,남학생,여학생,전체,남학생,여학생
1,2020,구분,35.1,29.8,40.8,25.4,21.2,29.9,11.2,8.8,13.8

In [80]:
pd.read_excel("./data/teen.xls", header=1)

     기간 구분     전체   남학생   여학생  전체.1  남학생.1  여학생.1  전체.2  남학생.2  여학생.2
0  2020  구분  35.1  29.8  40.8  25.4   21.2   29.9  11.2    8.8   13.8

In [81]:
pd.read_excel("./data/teen.xls", header=1, usecols="C:K")

     전체   남학생   여학생  전체.1  남학생.1  여학생.1  전체.2  남학생.2  여학생.2
0  35.1  29.8  40.8  25.4   21.2   29.9  11.2    8.8   13.8

In [105]:
col_names=["스트레스","스트레스남학생","스트레스여학생","우울감경혐율","우울남학생","우울여학생","자살생각율","자살남학생율","자살여학생율"]
raw_data=pd.read_excel("./data/teen.xls", header=1, usecols="C:K", names=col_names)
raw_data

   스트레스  스트레스남학생  스트레스여학생  우울감경혐율  우울남학생  우울여학생  자살생각율  자살남학생율  자살여학생율
0  35.1     29.8     40.8    25.4   21.2   29.9   11.2     8.8    13.8

In [113]:
raw_data.loc[1]=100-raw_data.loc[0]
raw_data.loc[1]

스트레스       64.9
스트레스남학생    70.2
스트레스여학생    59.2
우울감경혐율     74.6
우울남학생      78.8
우울여학생      70.1
자살생각율      88.8
자살남학생율     91.2
자살여학생율     86.2
Name: 1, dtype: float64

In [114]:
raw_data.loc[1]

스트레스       64.9
스트레스남학생    70.2
스트레스여학생    59.2
우울감경혐율     74.6
우울남학생      78.8
우울여학생      70.1
자살생각율      88.8
자살남학생율     91.2
자살여학생율     86.2
Name: 1, dtype: float64

In [119]:
pd.DataFrame(columns=(raw_data))

ValueError: Index data must be 1-dimensional